xvicam/mvp/cyclist/esp32/src/main.cpp
#include <Arduino.h>
#include <cmath>
#if defined(ESP32)
#include <esp32-hal-ledc.h>
#endif
#include <esp_now.h>
#include <esp_wifi.h>
#include <WiFi.h>
#include <NimBLEDevice.h>
#include <esp_sleep.h>

#include "../include/AccGyro.h"
#include "../include/CrashDetector.h"
#include "../include/Gnss.h"

#define BUTTON_PIN 14

// IMU interrupt pin (LSM6DSOX INT1/INT2 wired here)
#define IMU_INT_PIN 4

// External RGB LED pins (R,G,B). You said: GPIO 26, 2, 25
#define RGB_R_PIN 26
#define RGB_G_PIN 13
#define RGB_B_PIN 25
#define batteryPin A2

// Set true if your RGB LED is common-anode (active LOW). False for common-cathode (active HIGH).
constexpr bool RGB_COMMON_ANODE = false;

#if defined(ESP32)
  #define STATUSLED_USE_LEDC_ATTACH 1
#else
  #define STATUSLED_USE_LEDC_ATTACH 0
#endif

namespace statusLed {
    enum class Mode : uint8_t {
        Operating,
        Bonding,
        Crash,
        Configuring
    };

    static Mode mode = Mode::Operating;

    // LEDC PWM setup (avoid visible flicker)
    static constexpr uint32_t kPwmFreqHz = 5000;
    static constexpr uint8_t kPwmResolutionBits = 8; // 0..255

#if STATUSLED_USE_LEDC_ATTACH

#else
    // v2 and older: fixed channels and explicit setup
    static constexpr uint8_t kChR = 0;
    static constexpr uint8_t kChG = 1;
    static constexpr uint8_t kChB = 2;
#endif

    static inline uint8_t applyPolarity(uint8_t v) {
        return RGB_COMMON_ANODE ? static_cast<uint8_t>(255 - v) : v;
    }

    static void writeRgb(uint8_t r, uint8_t g, uint8_t b) {
#if STATUSLED_USE_LEDC_ATTACH
        ledcWrite(RGB_R_PIN, applyPolarity(r));
        ledcWrite(RGB_G_PIN, applyPolarity(g));
        ledcWrite(RGB_B_PIN, applyPolarity(b));
#else
        ledcWrite(kChR, applyPolarity(r));
        ledcWrite(kChG, applyPolarity(g));
        ledcWrite(kChB, applyPolarity(b));
#endif
    }
    static bool phaseOn(uint32_t nowMs, uint32_t periodMs, uint8_t dutyPct) {
        if (periodMs == 0) return false;
        const uint32_t onMs = (static_cast<uint64_t>(periodMs) * dutyPct) / 100;
        return (nowMs % periodMs) < onMs;
    }

void init() {
#if STATUSLED_USE_LEDC_ATTACH
        ledcAttach(RGB_R_PIN, kPwmFreqHz, kPwmResolutionBits);
        ledcAttach(RGB_G_PIN, kPwmFreqHz, kPwmResolutionBits);
        ledcAttach(RGB_B_PIN, kPwmFreqHz, kPwmResolutionBits);
#else
        ledcSetup(kChR, kPwmFreqHz, kPwmResolutionBits);
        ledcSetup(kChG, kPwmFreqHz, kPwmResolutionBits);
        ledcSetup(kChB, kPwmFreqHz, kPwmResolutionBits);

        ledcAttachPin(RGB_R_PIN, kChR);
        ledcAttachPin(RGB_G_PIN, kChG);
        ledcAttachPin(RGB_B_PIN, kChB);
#endif

        writeRgb(0, 0, 0);
    }
    void setMode(Mode m) {
        mode = m;
    }

    void update(uint32_t nowMs) {
        // Requirements:
        // - Bonding: flash BLUE
        // - Operating: flash GREEN slowly
        // - Crash: flash RED
        // - Configuring: flash CYAN
        switch (mode) {
            case Mode::Bonding: {
                const bool on = phaseOn(nowMs, 250, 50); // 4Hz
                writeRgb(0, 0, on ? 255 : 0);
                break;
            }
            case Mode::Operating: {
                const bool on = phaseOn(nowMs, 2000, 10); // brief pulse every 2s
                writeRgb(0, on ? 255 : 0, 0);
                break;
            }
            case Mode::Crash: {
                const bool on = phaseOn(nowMs, 500, 50); // 1Hz
                writeRgb(on ? 255 : 0, 0, 0);
                break;
            }
            case Mode::Configuring: {
                const bool on = phaseOn(nowMs, 1000, 50); // 1Hz
                writeRgb(0, on ? 255 : 0, on ? 255 : 0);
                break;
            }
        }
    }
}

namespace sys {
    bool isBonding = false;
    bool bondingCompleteFlag = false;
    uint32_t bondingStartTime = 0;

    bool isConfiguring = false;
    uint32_t configuringStartTime = 0;

    bool isCrashed = false;
    crash::CrashEvent lastCrash;
    ImuOrientation lastCrashOrientation;
    uint32_t crashModeStartTime = 0;
    bool crashNotificationAcknowledged = false;

    bool useStaticGps = false;
    bool useStaticImu = false;
    bool useStaticSpeed = false;
    bool useStaticHeading = false;
    float staticLat = 52.4862f, staticLng = -1.8904f, staticAlt = 150.0f;
    float staticAx = 0.0f, staticAy = 0.0f, staticAz = 9.81f;
    float staticGx = 0.0f, staticGy = 0.0f, staticGz = 0.0f;
    float staticSpeed = 10.0f, staticHeading = 90.0f;

    bool anyStaticEnabled() {
        return useStaticGps || useStaticImu || useStaticSpeed || useStaticHeading;
    }

    void enterBonding();
    void enterOperating();
    void enterConfiguring();
    void enterCrashMode(const crash::CrashEvent& ev, const ImuOrientation& o);

}

// Forward declarations (used by power manager before full namespace definitions)
namespace ble {
    void stopAdvertising();
}

namespace espNow {
    uint8_t broadcastAddress[] = {0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF};
    esp_now_peer_info_t peerInfo;
    uint32_t lastSendMs = 0;
    // Store the most recent IMU sample for broadcast
    ImuSample lastImuSample{};
    gnss::Fix previousFix{};
    constexpr uint32_t kSendPeriodMs = 250;
    uint32_t messageCounter = 0;
    bool isInitialised = false;

    namespace led {
        uint32_t offAtMs = 0;

        void init() {
            pinMode(LED_BUILTIN, OUTPUT);
            digitalWrite(LED_BUILTIN, LOW);
        }

        void pulse(uint32_t durationMs) {
            digitalWrite(LED_BUILTIN, HIGH);
            offAtMs = millis() + durationMs;
        }

        void update() {
            if (offAtMs != 0 && millis() >= offAtMs) {
                digitalWrite(LED_BUILTIN, LOW);
                offAtMs = 0;
            }
        }
    }

    void initSerialAndLed() {
        Serial.begin(115200);
        led::init();
    }

    bool initEspNow() {
        WiFi.mode(WIFI_STA);
        esp_wifi_set_protocol(WIFI_IF_STA, WIFI_PROTOCOL_LR);
        esp_wifi_set_max_tx_power(78);

        if (esp_now_init() != ESP_OK) return false;

        memset(&peerInfo, 0, sizeof(peerInfo));
        memcpy(peerInfo.peer_addr, broadcastAddress, 6);
        peerInfo.channel = 0;
        peerInfo.encrypt = false;

        if (esp_now_add_peer(&peerInfo) != ESP_OK) return false;

        isInitialised = true;
        return true;
    }

    void stopEspNow() {
        if (isInitialised) {
            esp_now_deinit();
            WiFi.mode(WIFI_OFF);
            isInitialised = false;
        }
    }

    void sendEspNowBroadcast() {
        if (!isInitialised) return;

        // --- GPS ---
        const gnss::Fix currentFix = gnss::lastFix();
        const bool realGpsValid = gnss::hasFix(30000);
        bool gpsValid;
        double lat, lng, alt;
        if (sys::useStaticGps) {
            gpsValid = true;
            lat = sys::staticLat;
            lng = sys::staticLng;
            alt = sys::staticAlt;
        } else {
            gpsValid = realGpsValid;
            lat = currentFix.latDeg;
            lng = currentFix.lngDeg;
            alt = currentFix.altMeters;
        }

        // --- IMU ---
        float ax, ay, az, gx, gy, gz;
        if (sys::useStaticImu) {
            ax = sys::staticAx; ay = sys::staticAy; az = sys::staticAz;
            gx = sys::staticGx; gy = sys::staticGy; gz = sys::staticGz;
        } else {
            ax = lastImuSample.ax; ay = lastImuSample.ay; az = lastImuSample.az;
            gx = lastImuSample.gx; gy = lastImuSample.gy; gz = lastImuSample.gz;
        }
        float accelMag = sqrt(ax*ax + ay*ay + az*az);

        // --- Speed ---
        float speed = sys::useStaticSpeed ? sys::staticSpeed : 0.0f;

        // --- Heading ---
        float headingDeg;
        if (sys::useStaticHeading) {
            headingDeg = sys::staticHeading;
        } else {
            headingDeg = 0.0f;
            if (realGpsValid && espNow::previousFix.valid) {
                const double kPi = 3.14159265358979323846;
                double lat1 = espNow::previousFix.latDeg * kPi / 180.0;
                double lon1 = espNow::previousFix.lngDeg * kPi / 180.0;
                double lat2 = currentFix.latDeg * kPi / 180.0;
                double lon2 = currentFix.lngDeg * kPi / 180.0;
                double dLon = lon2 - lon1;
                double y = sin(dLon) * cos(lat2);
                double x = cos(lat1) * sin(lat2) - sin(lat1) * cos(lat2) * cos(dLon);
                double bearing = atan2(y, x);
                bearing = fmod((bearing * 180.0 / kPi) + 360.0, 360.0);
                headingDeg = static_cast<float>(bearing);
            }
        }
        if (!sys::useStaticGps) espNow::previousFix = currentFix;

