xvicam/mvp/cyclist/esp32/src/main.cpp
        // Stop radios cleanly.
        espNow::stopEspNow();
        ble::stopAdvertising();

        const bool buttonOnlyWake = (sleepReason == SleepReason::Button);
        uint64_t wakeMask = (1ULL << BUTTON_PIN);
        if (!buttonOnlyWake) {
            wakeMask |= (1ULL << IMU_INT_PIN);
        }

        if (kImuWakeLevel == 1 || kButtonWakeLevel == 1) {
            esp_sleep_enable_ext1_wakeup(wakeMask, ESP_EXT1_WAKEUP_ANY_HIGH);
        } else {
            esp_sleep_enable_ext1_wakeup(wakeMask, ESP_EXT1_WAKEUP_ALL_LOW);
        }

        // Give BLE/WiFi stacks a moment to quiesce and let Serial flush.
        delay(200);
        esp_deep_sleep_start();
    }

    void onBootPrintWakeReason() {
        const auto cause = esp_sleep_get_wakeup_cause();
        Serial.print("Wake cause: ");
        switch (cause) {
            case ESP_SLEEP_WAKEUP_EXT1: {
                const uint64_t mask = esp_sleep_get_ext1_wakeup_status();
                Serial.printf("EXT1 (mask=0x%llX)", static_cast<unsigned long long>(mask));
                if (mask & (1ULL << BUTTON_PIN)) Serial.print(" [BUTTON]");
                if (mask & (1ULL << IMU_INT_PIN)) Serial.print(" [IMU]");
                Serial.println();
                break;
            }
            case ESP_SLEEP_WAKEUP_TIMER: Serial.println("TIMER"); break;
            case ESP_SLEEP_WAKEUP_UNDEFINED: Serial.println("POWERON/RESET"); break;
            default: Serial.printf("%d\n", static_cast<int>(cause)); break;
        }
    }

    void enforceHoldToWakeFromButtonOrStill() {
        const SleepReason lastReason = getLastSleepReason();
        if (lastReason != SleepReason::Button && lastReason != SleepReason::Still) return;
        if (esp_sleep_get_wakeup_cause() != ESP_SLEEP_WAKEUP_EXT1) return;

        const uint64_t mask = esp_sleep_get_ext1_wakeup_status();
        if ((mask & (1ULL << BUTTON_PIN)) == 0) return;

        constexpr uint32_t kWakeHoldMs = 2000;
        constexpr uint32_t kPollDelayMs = 2;

        if (digitalRead(BUTTON_PIN) != kButtonWakeLevel) {
            Serial.println("Wake hold not detected, returning to sleep...");
            enterDeepSleep("wake hold not met", lastReason);
        }

        const uint32_t startMs = millis();
        const uint32_t deadlineMs = startMs + kWakeHoldMs;

        while (digitalRead(BUTTON_PIN) == kButtonWakeLevel) {
            const uint32_t nowMs = millis();
            if (static_cast<int32_t>(nowMs - deadlineMs) >= 0) {
                Serial.println("Wake hold satisfied.");
                setLastSleepReason(SleepReason::Unknown);
                return;
            }
            delay(kPollDelayMs);
        }

        Serial.println("Wake hold released early, returning to sleep...");
        enterDeepSleep("wake hold not met", lastReason);
    }

    void update(uint32_t nowMs, bool isMoving) {
        if (ignoreWakeUntilMs != 0 && nowMs < ignoreWakeUntilMs) {
            return;
        }
        if (!eligibleToSleep()) {
            armed = false;
            stillSinceMs = 0;
            return;
        }

        if (!armed) {
            armImuInterrupt();
            armed = true;
            lastMovingMs = nowMs;
            stillSinceMs = 0;
        }

        if (isMoving) {
            lastMovingMs = nowMs;
            stillSinceMs = 0;
            return;
        }

        // not moving
        if (stillSinceMs == 0) {
            // require a short debounce interval after last detected movement
            if (nowMs - lastMovingMs >= kStillDebounceMs) {
                stillSinceMs = nowMs;
            }
            return;
        }
        if (nowMs - stillSinceMs >= kStillToSleepMs) {
            enterDeepSleep("still threshold reached", SleepReason::Still);
        }
    }
}

namespace ble {
    static const NimBLEUUID SVC("1b4d9b4b-9d59-4c4a-8ec6-4f0d8d5cc9e1");
    static const NimBLEUUID CHR("1b4d9b4b-9d59-4c4a-8ec6-4f0d8d5cc9e2");

    static NimBLEServer *srv;
    static NimBLECharacteristic *chr;
    static bool hasBonds() { return NimBLEDevice::getNumBonds() > 0; }

    struct SrvCb : NimBLEServerCallbacks {
        void onConnect(NimBLEServer *s, NimBLEConnInfo &connInfo) override {
            Serial.printf("BLE Client Connected! Address: %s, Bonded: %d\n", connInfo.getAddress().toString().c_str(), connInfo.isBonded());
            if (hasBonds() && !NimBLEDevice::isBonded(connInfo.getAddress())) {
                Serial.println("Rejecting unbonded connection.");
                s->disconnect(connInfo.getConnHandle());
            }
        }

        void onDisconnect(NimBLEServer *s, NimBLEConnInfo &connInfo, int reason) override {
            Serial.printf("BLE Client Disconnected! Reason: %d\n", reason);
            if (sys::isBonding) NimBLEDevice::startAdvertising();
        }

        void onAuthenticationComplete(NimBLEConnInfo &connInfo) override {
            if (connInfo.isBonded()) {
                sys::bondingCompleteFlag = true;
            } else if (!connInfo.isEncrypted()) {
                NimBLEDevice::getServer()->disconnect(connInfo.getConnHandle());
            }
        }
    };

    static SrvCb cbs;

    struct ChrCb : NimBLECharacteristicCallbacks {
        void onWrite(NimBLECharacteristic *pCharacteristic, NimBLEConnInfo& connInfo) override {
            std::string val = pCharacteristic->getValue();
            if (val.find("ACK") != std::string::npos) {
                sys::crashNotificationAcknowledged = true;
                Serial.println("Crash notification acknowledged by APP!");
            } else if (sys::isConfiguring) {
                // Per-group toggles
                if (val.find("STATIC_GPS:1") != std::string::npos) {
                    sys::useStaticGps = true;
                    Serial.println("Static GPS ENABLED");
                } else if (val.find("STATIC_GPS:0") != std::string::npos) {
                    sys::useStaticGps = false;
                    Serial.println("Static GPS DISABLED");
                } else if (val.find("STATIC_IMU:1") != std::string::npos) {
                    sys::useStaticImu = true;
                    Serial.println("Static IMU ENABLED");
                } else if (val.find("STATIC_IMU:0") != std::string::npos) {
                    sys::useStaticImu = false;
                    Serial.println("Static IMU DISABLED");
                } else if (val.find("STATIC_SPEED:1") != std::string::npos) {
                    sys::useStaticSpeed = true;
                    Serial.println("Static Speed ENABLED");
                } else if (val.find("STATIC_SPEED:0") != std::string::npos) {
                    sys::useStaticSpeed = false;
                    Serial.println("Static Speed DISABLED");
                } else if (val.find("STATIC_HEADING:1") != std::string::npos) {
                    sys::useStaticHeading = true;
                    Serial.println("Static Heading ENABLED");
                } else if (val.find("STATIC_HEADING:0") != std::string::npos) {
                    sys::useStaticHeading = false;
                    Serial.println("Static Heading DISABLED");
                } else if (val.find("STATIC_VALS:") == 0) {
                    int parsed = sscanf(val.c_str(), "STATIC_VALS:%f,%f,%f,%f,%f,%f,%f,%f,%f,%f,%f",
                                        &sys::staticLat, &sys::staticLng, &sys::staticAlt,
                                        &sys::staticAx, &sys::staticAy, &sys::staticAz,
                                        &sys::staticGx, &sys::staticGy, &sys::staticGz,
                                        &sys::staticSpeed, &sys::staticHeading);
                    Serial.printf("Parsed %d static values\n", parsed);
                } else if (val.find("MODE:OPERATING") != std::string::npos) {
                    Serial.println("App requested switch to OPERATING mode.");
                    sys::enterOperating();
                }
            } else {
                Serial.println("Config command received but not in Configuring Mode. Ignoring.");
            }
        }
    };
    static ChrCb chrCb;

