xvicam/mvp/cyclist/esp32/src/main.cpp
            if (!sys::isCrashed) {
                sys::enterCrashMode(mockEv, o);
                Serial.println("Simulated crash triggered. Switched to BLE Mode.");
            } else {
                Serial.println("Already in crash mode.");
            }
        }
    }

    static uint32_t lastPulseMs = 0;
    uint32_t pulseInterval = sys::isBonding ? 250 : 2000;
    if (now - lastPulseMs > pulseInterval) {
        lastPulseMs = now;
        espNow::led::pulse(50);
    }

    static constexpr uint32_t kButtonLongPressMs = 2000;
    static constexpr uint32_t kButtonCrashLongPressMs = 5000;
    static constexpr uint32_t kButtonDoublePressGapMs = 400;
    static constexpr uint32_t kButtonDebounceMs = 30;

    static bool btnPrev = false;
    static uint32_t btnDownAt = 0;
    static uint32_t lastReleaseAt = 0;
    static uint8_t pressCount = 0;
    static bool longPressHandled = false;

    const bool btnNow = (digitalRead(BUTTON_PIN) == HIGH);

    if (btnNow && !btnPrev) {
        btnDownAt = now;
        longPressHandled = false;
    }

    if (!btnNow && btnPrev) {
        const uint32_t heldMs = (btnDownAt != 0) ? (now - btnDownAt) : 0;
        if (!longPressHandled && heldMs >= kButtonDebounceMs) {
            pressCount = static_cast<uint8_t>(pressCount + 1);
            lastReleaseAt = now;
        }
        btnDownAt = 0;
    }

    if (btnNow && !longPressHandled && btnDownAt != 0) {
        const uint32_t holdMs = sys::isCrashed ? kButtonCrashLongPressMs : kButtonLongPressMs;
        if ((now - btnDownAt) >= holdMs) {
            longPressHandled = true;
            pressCount = 0;
            Serial.println(sys::isCrashed
                ? "Button held for 5 seconds in crash mode, entering deep sleep..."
                : "Button held for 2 seconds, entering deep sleep...");
            powerMgr::enterDeepSleep("button long press", powerMgr::SleepReason::Button);
        }
    }

    if (pressCount > 0 && (now - lastReleaseAt) > kButtonDoublePressGapMs) {
        if (pressCount >= 3) {
            if (sys::isCrashed) {
                Serial.println("Button triple-press in crash mode, ignoring...");
            } else {
                Serial.println("Button triple-pressed, entering configuring mode...");
                sys::enterConfiguring();
            }
        } else if (pressCount == 2) {
            if (sys::isCrashed) {
                Serial.println("Button double-press in crash mode, ignoring bonding request...");
            } else if (!sys::isBonding) {
                Serial.println("Button double-pressed, entering bonding mode...");
                sys::enterBonding();
            } else {
                Serial.println("Button double-pressed, exiting bonding mode...");
                sys::enterOperating();
            }
        }
        pressCount = 0;
    }

    btnPrev = btnNow;

    if (sys::bondingCompleteFlag) {
        sys::bondingCompleteFlag = false;
        sys::enterOperating();
    }

    if (sys::isBonding && (now - sys::bondingStartTime > 120000)) {
        Serial.println("Bonding timeout, entering operating mode...");
        sys::enterOperating();
    }

    if (sys::isConfiguring && (now - sys::configuringStartTime > 120000)) {
        Serial.println("Configuring timeout, entering operating mode...");
        sys::enterOperating();
    }

    if (imuPrint::initialised && (now - imuPrint::lastPrintMs >= imuPrint::kPrintPeriodMs)) {
        imuPrint::lastPrintMs = now;
        ImuSample s;

        if (imuPrint::imu.readSample(s)) {
            espNow::lastImuSample = s;
            const ImuOrientation o = imuPrint::imu.computeOrientation(s);
            static crash::CrashDetector detector;
            const crash::CrashEvent ev = detector.update(now, s, o);

            if (ev.triggered && !sys::isCrashed) {
                sys::enterCrashMode(ev, o);
            }

            int rawValue = analogRead(batteryPin);
            float voltage = (rawValue / 4095.0) * 3.3 * 2.0;
            float percentage = (voltage - 3.3) / (4.2 - 3.3) * 100;

            if (percentage > 100) percentage = 100;
            if (percentage < 0) percentage = 0;

            // --- GPS serial ---
            if (sys::useStaticGps) {
                Serial.printf("[S]GPS - Lat: %.7f, Lng: %.7f, Alt: %.2f | ",
                              sys::staticLat, sys::staticLng, sys::staticAlt);
            } else {
                const gnss::Fix fix = gnss::lastFix();
                if (gnss::hasFix(30000)) {
                    Serial.printf("GPS - Lat: %.7f, Lng: %.7f, Alt: %.2f | ", fix.latDeg, fix.lngDeg, fix.altMeters);
                } else {
                    Serial.print("GPS - Waiting for fix... | ");
                }
            }

            // --- IMU serial ---
            if (sys::useStaticImu) {
                Serial.printf("[S]Accel: %.2f,%.2f,%.2f | [S]Gyro: %.2f,%.2f,%.2f | ",
                              sys::staticAx, sys::staticAy, sys::staticAz,
                              sys::staticGx, sys::staticGy, sys::staticGz);
            } else {
                imuPrint::printImuLine(s, o);
            }

            // --- Speed & Heading serial ---
            if (sys::useStaticSpeed) Serial.printf("[S]Speed: %.2f | ", sys::staticSpeed);
            if (sys::useStaticHeading) Serial.printf("[S]Heading: %.2f | ", sys::staticHeading);

            Serial.printf("Voltage: %.2fV | Pct: %.1f%%\n", voltage, percentage);

            powerMgr::update(now, o.isMoving);
        }
    }

    if (sys::isCrashed) {
        if (sys::crashNotificationAcknowledged || (millis() - sys::crashModeStartTime > 120000)) {
            Serial.println("Crash mode ended (ACK received or timeout). Returning to operating mode...");
            sys::enterOperating();
        } else {
            static uint32_t lastCrashSend = 0;
            if (now - lastCrashSend > 1000) {
                lastCrashSend = now;
                ble::sendCrash(sys::lastCrash.crashId, sys::lastCrash.peakDynamicMps2, sys::lastCrashOrientation);
            }
        }
    }

    if (sys::isBonding || sys::isConfiguring) ble::tick(now);
}
